mesh_ground/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       560;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       570;
    }
    axis
    {
        type            patch;
        nFaces          30;
        startFace       580;
    }
    heatedWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          10;
        startFace       610;
    }
    unheatedWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          20;
        startFace       620;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          600;
        startFace       640;
    }
)

// ************************************************************************* //
